import streamlit as st  # streamlit 라이브러리 임포트

# 타이틀 텍스트 출력
st.title('산업·데이터공학과 관련 직업1')

# 텍스트 출력
st.write('# 정보시스템운영자')

# Markdown 문법으로 작성된 문장 출력
st.markdown(
    '''
    ## 하는 일
    - 정보시스템운영자는 기업이나 기관에서 운영하고 있는 정보시스템을 안전하고 체계적으로 운영 및 관리하고 사용자들에게 서비스를 제공하는 일을 한다. 정보시스템의 하드웨어나 네트워크 장비는 외부 환경에 영향을 받기 쉬우므로 이를 관리하고, 시스템적으로도 문제가 발생하면 즉시 원인을 파악하여 복구한다.

    ## 적성 및 흥미
    - **적성**: 각종 컴퓨터 운영체제와 소프트웨어, 정보시스템 구성에 대한 기술적 지식을 가지고 전체 시스템을 논리적이고 체계적으로 운영할 수 있는 수리·논리력이 필요하다.
    - **흥미**: 정보시스템에서 발생하는 기술적, 물리적 문제를 해결하기 위한 방법을 찾고 정보시스템 운영에 대한 책임감을 가진 사람에게 적합하다.

    ## 관련 내용
    - **관련 직업명**: 웹마스터, 시스템엔지니어, 정보보호전문가, 고객관리시스템(CRM)전문가, 전자상거래전문가, 클라우드 시스템 엔지니어, 스마트 그리드 엔지니어
    - **관련학과**: 시스템공학과, 시스템경영공학과,정보통신공학과
    - **관련 자격증**: 전자계산기조직응용기사, 정보관리기술사, 정보처리기능사, 정보처리기사, 정보처리산업기사, 마이크로소프트 인증 전문가 자격증(MCP), 오라클 자격인증제도 SQL
    '''
    )

st.markdown(
    '''
    ### 참고문헌
    - [정보시스템운영자-직업백과](https://www.career.go.kr/cnet/front/base/job/jobView.do?SEQ=938)
    ''')

# 타이틀 텍스트 출력
st.title('산업·데이터공학과 관련 직업2')

# 텍스트 출력
st.write('# 산업공학기술자')

# Markdown 문법으로 작성된 문장 출력
st.markdown(
    '''
    ## 하는 일
    - 산업공학기술자는 기업경영에 대하여 사회과학적 전문 지식과 자연과학적 원리를 응용하여 경영의 여러 요소를 과학적으로 분석하고 조정하는 업무를 수행한다. 생산을 위한 최적의 수준을 결정하고 기계, 원자재, 자원의 최적 활용을 위한 프로그램을 실행한다. 경영 기획, 기술 전략, 경영 정보 시스템 분야 등에서 회사에 영향을 끼치는 다양한 요인들을 분석하고 사업전략과 경영관리 방법을 모색한다.

    ## 적성 및 흥미
    - **적성**: 시설을 계획하고 설계해야 하므로 입체적인 물체의 위치나 모습을 상상하여 떠올릴 수 있는 능력인 공간지각력이 필요히다.
    - **흥미**: 사회과학과 컴퓨터, 공학적 지식에 대해 관심이 있고, 깊게 탐구하는 과정을 즐기는 사람에게 적합하다.

    ## 관련 내용
    - **관련 직업명**: 생산관리기술자, 경영정보시스템전문가, 품질관리기술자
    - **관련학과**: 전기전자공학과, 기계설계공학과, 기계공학과, 산업공학과, 전기공학과, 안전공학과
    - **관련 자격증**: 산업안전기사, 산업안전산업기사, 산업안전지도사, 품질경영산업기사, 공장관리기술사, 품질경영기사
    '''
    )

st.markdown(
    '''
    ### 참고문헌
    - [산업공학기술자-직업백과](https://www.career.go.kr/cnet/front/base/job/jobView.do?SEQ=83)
    ''')
