import streamlit as st  # streamlit 라이브러리 임포트

# 타이틀 텍스트 출력
st.title('산업·데이터공학과 관련 직업3')

# 텍스트 출력
st.write('# 경영컨설턴트')

# Markdown 문법으로 작성된 문장 출력
st.markdown(
    '''
    ## 하는 일
    - 경영컨설턴트는 경영과 경제에 대한 지식을 바탕으로 기업경영에 관한 문제점을 분석하고 대책을 연구하며, 사업 추진에 관한 상담과 자문을 제공한다. 업의 인사, 조직, 노무, 사무관리에 대한 진단과 지도를 돕고, 효율적인 경영을 위해 재무관리와 회계에 대한 진단과 지도를 돕는다. 기업경영 전반에 대한 상담, 자문, 분석, 평가, 확인, 대행 등을 수행한다.

    ## 적성 및 흥미
    - **적성**: 기업경영 관련 상담에서 적절한 단어를 사용할 수 있고 논리적으로 생각을 말로 표현할 수 있는 능력과 다양한 정보를 근거로 새로운 결론을 이끌어낼 수 있는 수리·논리력이 필요하다.
    - **흥미**:  다른 사람의 생각이나 관점에 영향을 주고 싶어 하고 다른 사람의 감정을 잘 이해하는 사교적인 모습을 가진 사람에게 적합하다.

    ## 관련 내용
    - **관련 직업명**: 경영지도사, 기업분석가
    - **관련학과**: 세무학과, 경영학과, 경제학과, 교육학과, 국제통상학과, 무역학과, 법학과, 산업공학과, 심리학과, 회계학과
    - **관련 자격증**: 경영지도사, 기술지도사
    '''
    )

st.markdown(
    '''
    ### 참고문헌
    - [경영컨설턴트-직업백과](https://www.career.go.kr/cnet/front/base/job/jobView.do?SEQ=202)
    ''')

# 타이틀 텍스트 출력
st.title('산업·데이터공학과 관련 직업4')

# 텍스트 출력
st.write('# 물류관리사')

# Markdown 문법으로 작성된 문장 출력
st.markdown(
    '''
    ## 하는 일
    - 물류관리사는 물류에 관한 전문 지식을 바탕으로 화물의 수송, 보관, 짐을 싣고 내리는 하역, 포장 등의 물류체계를 합리적으로 구축하거나 이에 대한 상담과 자문 업무를 담당한다.  물류의 이동, 보관, 비용 등을 분석하고 분석 결과를 바탕으로 기업의 물류관리와 물류 지원 시스템을 가장 합리적이고 경제적으로 실행할 방법을 설계하고 실행한다.

    ## 적성 및 흥미
    - **적성**: 물류 이동과 관련해 현재 처한 상황에서 가장 효율적이고 합리적인 방법을 모색해 논리적으로 계획을 짜고 이를 실행할 수 있는 수리·논리력이 필요하다.
    - **흥미**:  합리적인 사고를 통해 물류체계를 구축하고, 물류비 절감 방안을 도출할 수 있는 사람에게 적합하다.

    ## 관련 내용
    - **관련 직업명**: 물류정보관리사, 물류사무원
    - **관련학과**: 무역학과, 물류학과, 무역학과, 물류시스템공학과, 유통경영과, 유통학과
    - **관련 자격증**: 물류관리사, 유통관리사, ERP물류정보관리사
    '''
    )

st.markdown(
    '''
    ### 참고문헌
    - [물류관리사-직업백과](https://www.career.go.kr/cnet/front/base/job/jobView.do?SEQ=215)
    ''')
